# Inequality Operator (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetId..::..Inequality Operator
WorksetId Class See Also
---
Determines whether these two WorksetIds are different.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator !=(
	WorksetId first,
	WorksetId second
)
```

Visual Basic
---
```text
Public Shared Operator <> ( _
	first As WorksetId, _
	second As WorksetId _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator !=(
	WorksetId^ first,
	WorksetId^ second
)
```

# ### Parameters
first
    Type: Autodesk.Revit.DB..::..WorksetIdThe first WorksetId.
second
    Type: Autodesk.Revit.DB..::..WorksetIdThe second WorksetId.
# ### Return Value
True if the WorksetIds are different; otherwise, false.
# See Also
WorksetId Class
Autodesk.Revit.DB Namespace